#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "80d40f6b2398afa2e3a08bc5538c94d8" -> "ad752866a9136c93240cef13f5f2e0d5"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "6e90484feda1888f31c71642c1e04d75" -> "a72ce5a026388a0aef79351c945d6db2"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "c1a453262c15c1282ef3810ccaf67c84" -> "bcf93341c977b5d770a793d3d72cd34a"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "2d7f1d1dd7ee4a150357773337bb920d" -> "16c799a153d0e319d64ee104b04677cc"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "de8bf7ac1853499917e738ce032dc16c" -> "fbd6c0a680e16b5aa99dd1cd63ca0590"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "0501ccafe58809bcbbd694b3e9dafbdb" -> "e7a98d0c136ff0043c11f0173f51471e"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "62d13e86aa235fb0b4d9bb22d517758b" -> "9713fead63bbb355d11bc37161348b50"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "fa8d5328596c44e77ed0e669913b0122" -> "090709be5edf2ff27673becc57a08543"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "2f6f35b6e706e1110ef411669af7547a" -> "b88164ea0e6d9d61d48f92c94771a4d7"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "09cae3e624c88f148a53f9bf83d85f49" -> "063c102853e6c7215d1916141ff4a8ed"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "c800b7c4cb853e43c5ff571c012a8d3d" -> "bd6a99c5b114f6a7916fa9afb39d5933"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "328f816783e1dbec4921714e72d4f4d7" -> "7eb88ffa708a6a9dbf8e744022fdfb56"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "a5078d9af7a729e6adf3ff86350cf725" -> "bacdbbd942381156bf2a32ada7a0dc0d"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "cfa7530a1aa6edeb37e7cf836826735d" -> "5a706cf9c7c9ed2d16d28395ee261484"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "5ac73b560537c336d9e5ab8d0c720305" -> "297c43145c66bc79286f46d2209efae7"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "c7664b881ef5eb02aedf7e94d54338b5" -> "b21b2714ee2c1deeb35292b28340ac30"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "627b50f767548b59d865cfb162cdf664" -> "010046a8c7e66ac60d1d5e218ec6aaf3"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "f12f668ab03d7f1887f0c32341d03fa5" -> "b1bf1118cbeef9f112d6313a353caeaa"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "df20c594c5ba3878cb289f2092b97dc6" -> "2db8129429ea8e1b5a116bd269fbdd2a"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "96471538b0e23956571e02d8160b7382" -> "1666bb6b97a48c18da2d65b2c918f162"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "b7e48c468b7e5ef36d2a0d60635cbcbe" -> "883f789c6bce0cc0c92f1814a9e56e26"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "8908960f88ce40fcdb1ffec207cbb0ad" -> "1be74148c64e0a50acfa798728aadd29"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "94fe860ded3d3997eb8ca3763101a655" -> "66c45107947ae2c98935173ef8fffe96"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "14acccac546748ee53c111f69329164f" -> "2e249ce4a6f285abb7a6fde93e3933ad"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "6b70f32f3c1f118b6f00883494bde79f" -> "819c085c9ab1cdd5d716308455cadc51"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "97a04186891c2841735416717409e486" -> "dc307fddff51ff3719c4804ed3d7f620"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "0a99aed4951ece5edf351a8736994b53" -> "75d713d711f0e3e62ac2899ac2a7caf2"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "262275cbf1357627b34f965aaeebeb7b" -> "90f370c84cdb158b5f7f9c9109238f27"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "974e6bf3ca6b64326678ab1b6cbff75f" -> "afec827bf8b0816c64f85064ccb451d2"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "6b686393d1d59e43afce68795ddec703" -> "d8092aea01c8e7c290938f6f39565aad"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "969325bac554ef69f88d232a4896071d" -> "cc464f567d534b8bba76d942b5bdf35d"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "6c435f4ee958e551ad441ed96462152a" -> "27b4ee37c2d554d65515fdd4c7ca8378"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "d120accceafbbf432b14c21f454c9e1d" -> "2543c5f4e30bc26c5356a6173192f71e"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "db361e87a2bfefe0588871f4acb435d6" -> "dcda95aa121c4c1a2b00b3a8d06fad34"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "969942d72977fa2062d81387362469a7" -> "0ef72287338680dfd0d19cab991f33c8"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "fed4842405a1fc530b169c7f1d33ba96" -> "844165db510913cf42fcd0282ca7ea69"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "2a5e1e2991f0221dd62e0a10acb40eaf" -> "458bb514cfed7464682e669cc7f6d321"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "b8d420a74277c014252865a8753f1eb9" -> "11edd9cf9fe8da780c1681c97b95bdfd"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be created
  + resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "fed68e409464a1968c5b08de32c9e979"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/modify_ranges_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/modify_ranges_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "c859bcc45e73cb5ff16cfe041f16c426" -> "e4aac4fe3828675c619d58bbb2f9e6fd"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "f4f4e3ec69473e3ed30bcf619ec11644" -> "b73175d95996d16cab4f3192be57ba9b"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "5573c37f3048302272bb101d10016aac" -> "056c3ec8ca49abc87e83fea48b7de0fe"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "08e18a3a66a12fd91d00cd9d4a33b937" -> "95dee8c367ffc13a500ec59a543db3b5"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "01321b1e9b306a11503b214c19dce63f" -> "86561e738c83f49b2dcfdf2d24e46a7d"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "8b03e919e09f0ef9691a6420114c1823" -> "5c2110809f223a8f33e2b22cb29e47c1"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "pz3htoD0yNlo6x0SHrigBiBUo7gdUoxPY/Ku3K2Atbc=" -> "0NqB+QUPZ96rqbAqXdf7kl2doNTOn+MQrJJLDcTyhMY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "uFbf4lqphaxxooKg/ZhertyLxix14CspjtI9hI3fDQo=" -> "NiVpXdio3xJJCphBd0QxbGyB2BjUnRhc2rZxFYHsV0Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "SbNUI5QYL84E99oTrv26R2DSJnXJpzZu4AtD95fYuGE=" -> "QgXf4IEPI+S0auVTweMSqo3y4s/9X85dHFjRs/BCzcw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "FOk5rgRrWLFbS195sL1zgZsmlsGomSBZsC583ngQteQ=" -> "UsaAQFySMlfPgQ/zRA7mSKyVDL/FL4Z5t5n2gzAysUs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "7uWq7APVF/i42CJSxe4ZbAFEySLMX6szl7npcR8zYQg=" -> "NOwWJNgC+DqEIG0VzqN2rb5TAr7rFJgMReujuudbCEI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "V8DJPePO2ysYdgJlvePikqKyT8bBqM6jEAeUq0Z35DU=" -> "DwnBN0PZ4HAuiW+U2GUA/74A2IqFnSid3ojxikMwCGI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "M0qv/E7aSFeRKn19Q81eAk1yr4/ugKD7hk1z2rFFp88=" -> "Dun2VEUCupHHfyDar8cLfPA7z0A0noLTZI085KtUjXc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "gKNcksXN0wa8i/FXKkJ8FEyp9wCI/Tg3UwwsvobYWdM=" -> "HLxYJavLPBCa4feVx0uJkvNGBTJLLdBc9o5cJOIQwdk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "72nnnjaxAOm3s5N6rweO0T8LVl9dYPyC8LRdpRXw+Ug=" -> "HSrl5qFjU0Ba9XDhh8u9S3IQINT39lx/aXvleagWaPc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Cx3ej0kRI4s/vC172/kIgVXKpt52eo69+sgXAE0HRtQ=" -> "gUgYg6l0gC3EqVgzXgMJUZmDqK+ZS7eFf/mQBhyfn2I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "Tq7tJtoO6oWppe0inIpIZ1vXDNtvtJ7BXHLzeOOnGJE=" -> "Q0+8Jr2THhF+JjMr/2f/2jCzrMrkwLSuzhbr9Jz2lBU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "cjwN3AHZzZYnKc3oKP4EYLk9rgaOc7hmRXbjx07HrZk=" -> "dfQ2ZBFl+CWfhm+KVHO++skvJsgpgoJK4BhtXwjznU4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "gjaICGuKDu4YwCpm/taQjAkT30g32Xa4/ZnZrDrBRrA=" -> "cmYKL0hoaE+KpBaHfBK61hw0HfooCb5Cq6zWiWYs8Bg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "EH9ONU4wEjTC65k4bkYg4xSo8VFBuDHlMC4OwWb2nuM=" -> "3Gpt79XGyvp6rdXo13oeTufC4kKblmRFL7gB3TlbNqs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "83gNft9CciqnCfkFirTLxVKC+jAzZ3/707gwQqGMpio=" -> "YP2FD5b+s3DfZcpRdrO3/A5ICBnohpBtjSUVShypbjI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "u9wCH7HjzkFrgjZ3HTVqKcBkLqvJGbFJ2LNqbIBzKMs=" -> "iYKCCSfc7s2eQ4Z5rfXyZ/p+H+trnLIkg8qXTQqZFiI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "HeA+IRwBQzOATdr3YG1G7RKYRG7J/HD2srDMAYplr8U=" -> "WUU94lGifAwlX++6owOXGerN9d+FcQrSKobJe22ggT8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "ztYVVIXBG0LCnk9bOKqqYWKuRaJLow/Jmz9KSOrYki4=" -> "YjUhkrKU3vnyRHStJRLWJt9Z5wC9nJhb2JN+ytniBug="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "EkUpleTTnZK4EQQYUz5vBZygzmKp8W2/hqiLhP+tLDc=" -> "Ygmti67JXm8CZl62YZ9zLMdDkPlld06NXJDKE7CYaCk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "nlXDSgWSqKuoPdCBse9eMaj1t26p6lzXHWQwrRHCcNk=" -> "mxvaOf5sG7DxEprSKJ66ddu0iHOR4xQ7VoRAoIEzOy4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "deIbtMjgQiefvsWkBApK/2afkVKPeK1UiBlJaN6aMcM=" -> "/IB1jwhJudJmZxLN35uB3VaWiHg33xYMrq8iHg/sPPE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "qjeeELthImR/KTjs/UzYiSBOWPyr652GErsebgN6AaU=" -> "pJgk7lrx6tw6DJLD6fxBCsX10aT+jkGcCDLVWDpnrqM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "fBzD2YiadsPROd8U28Fxg5thT2qbxOrRo/Ureod2IWI=" -> "dhMqWhySE0PQrOgSJfznlVkHaPy/moNtU/jraFQLO4s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "AHcCUCTQBphwcSzRlmV+ShbE3UK/c+bia1mmmMZLqKU=" -> "qXuATJ7DXIKzUj8KJGpu55C0lBfIVspn9x7EKU4Ith4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "DX5KKbPwZjRN36Iv2luKiNn8T7G3mslgQUCrVP3Ch9E=" -> "GNSASdMPSrMJ0D6XZlqJG0mWfcHNEBlBfgkWSsLy2e8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "kfFSidhWh0eF/0CPXIj8YcjSlj1vsDEZiFq6EIyOxm8=" -> "20QfaActCQ3OXyhHGhChsNJN/spgDWdLS1HuQhszK+0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "La7Z4T5jatluSRSKnJymLur3BNaZnGAM4NcNB9lzjCM=" -> "1LSdqg+dAVUApgtVkxqZ53np2yLJVvogJTMHrll5JSE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "AvnP03wLKF4ZCXvJQcLOih6weaO0tmEAfAkFbKMvXnA=" -> "z1zzwJG6KZpHymhMMODE+TURKi8XVESRL/Kg52foaWs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "/a6m0Fg2e+yD+W2HMvt/KcP8sqnWdxeJ6+C1sfN8nB0=" -> "qsyQrUkqeJtyAS56HYfSz3JOvTvGQmUPr3dSqe3z5pA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "hrPh+qbjepVjFqR/ms/QN5v/y+YIwTML7Kz639PMncI=" -> "yBAIR4F7bLgJgJ8+oHhrCPNFb9pUtGZPIDFH8MHoHMc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ry3D4SuqfJXyFQEBbDJikMTsc+iid968GTDE12Dym7o=" -> "7JBigZ3I+O/nijUZYRXQWLNf4JfthDAs8gdyB2oSyeo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "ayMrDZVaN2uri1daMpHUdNS/cKQMiyjGL8mTKEvXwmo=" -> "8KO2kG84JYHu81/Mm5Sasbn05nascUgmOhyuDRtKNPU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "P+1qxqARajc3jpyh4hZfu5edrDafIkSmra8zSNaaPg8=" -> "IlEjDrngN3S1ARljnQ97ZJKovbtIHc+SN+ja5Mlf3JY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "pywKnu6y00eoREjkmVxmN1AUqAxp9FpWq9SfPVlqSUE=" -> "XbVK5Q+WVqZeOI0X15351Stp+RYP9KcAcIeZgmv5VSU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "u65H4hUOS+Fs5subesztK0fmevWmicwYirYTAZSGySA=" -> "ktcbA/VgYdjlRRzeUyAj9YIh4SznxV6+/vGloCvYd0w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "SdA9ZoqQxAWMRFhnd+cxv594QkuF2QTc9QzDMghe3cs=" -> "Bgdi+ZnoxmM47dOwfn9W6CD6r0jsV3bUeaPnK94iQFU="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "3lND2H6LF16D8D1jM7DbuH+eAuGgF186ClfBfEvXWLY=" -> "ZVKI6WCJBdJJK3qGVMteEKP7sYzZ0+S53/jutAfttmo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be created
  + resource "aws_lambda_function" "modify_ranges_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_modify_ranges_lambda_function"
      + handler                        = "modify_ranges_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/modify_ranges_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "EdHfzNl+bKYfeXtyqqyDSD+OXKRvAv1nC3zhqbDmFIo="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "glz/flXmItcDZ7p8Oqo/MEAxP88dFD3I59MeC3/fjUY=" -> "OPVSgrBbqggVHnF77+IKroCBFzp7PdA9sx/7a8lsBlI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "9DF5NccVpymq830SRBsYeaLKbPk/k5vHlc97UfMnzuU=" -> "rSlcketKxGiwMjaoupNxMr+DF/eb8iGvBtrGlNyDs6E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "Wygx505fhv8BSn+Vfuk1r+6bbLB3DVnW5J84+VV1Xzw=" -> "1fLn5TEg/Ae5wbTPIZhnZnita088StprrKNiueT4jho="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "wOO+YHgAF5dRu2QJwZ99289sLJ+lIqCX7DaY3GNSeWc=" -> "s4xYl2CF9FL+15iMJ+rbw9uAs3rD0q6zXg3uhcAVZwk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "C5tjjrynkpihF2ulYNusG6ZoAVt37Y5oXZWL0gAzlk8=" -> "KApsYj8ss3oQVMl7APNyQ/+6NGO6duzcFn9cHEoih/I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "EGvlWfq0aPsTOzU4plwNBuz4cNwrCFgLTULB7ju3HHU=" -> "2VF9l4GVDE4LsSmhCgdTeIMNx/yfhT3DNsnmQj4ySj0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-08T22:46:33Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "v9bqr6" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-08T22:46:31Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.modify_ranges_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "modify_ranges_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_modify_ranges_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.modify_ranges_integration will be created
  + resource "aws_api_gateway_integration" "modify_ranges_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "xqe34y"
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.modify_ranges_method will be created
  + resource "aws_api_gateway_method" "modify_ranges_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "PUT"
      + id               = (known after apply)
      + resource_id      = "xqe34y"
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-08T22:46:31Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.modify_ranges_lambda_exec_role will be created
  + resource "aws_iam_role" "modify_ranges_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_modify_ranges_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.modify_ranges_cognito_policy will be created
  + resource "aws_iam_role_policy" "modify_ranges_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_modify_ranges_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.modify_ranges_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "modify_ranges_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_modify_ranges_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.modify_ranges_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "modify_ranges_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_modify_ranges_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_modify_ranges_lambda will be created
  + resource "aws_lambda_permission" "apigw_modify_ranges_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_modify_ranges_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 11 to add, 89 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*